testPhase/StefanProblem/constant/phaseChangeProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseChangeProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
phaseChangeModel tempGrad;

tempGradCoeffs
{
    T0 [0 0 0 1 0 0 0]    3.64754e2;
    T1 [-1 1 2 1 0 0 0] 1.29050e-4;
    T2 [-2 2 4 1 0 0 0] 9.52855e-18;
    T3 [-3 3 6 1 0 0 0] -6.57279e-25;
    
    H0 [0 2 -2  0 0 0 0] 2260.0e3;
    H1 [0 2 -2 -1 0 0 0] 0.0;
    H2 [0 2 -2 -2 0 0 0] 0.0;
    H3 [0 2 -2 -3 0 0 0] 0.0;
}


DDT	  DDT  [0 2 0 0 0 0 0] .004;


// ************************************************************************* //
