testPhase/StefanProblem/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    frontHeated
    {
        type            epsilonWallFunction;
        value           uniform 0.1;
    }
    
    backOutlet
    {
    	type		inletOutlet;
    	inletValue	uniform 0.1;
    	value		uniform 0.1;
    }

   defaultFaces
   {
        type            empty;
   }

}


// ************************************************************************* //
