testPhase/StefanProblem/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 1
);

regions
(
    boxToCell
    {
        box (0 0 0) (.1 1 1);
        fieldValues
        (
            volScalarFieldValue alpha.water 0
            volScalarFieldValue T 378.15

        );
    }
    boxToCell
    {
        box (.1 0 0) (.11 1 1);
        fieldValues
        (
            volScalarFieldValue alpha.water .5
            
        );
    }
   
);


// ************************************************************************* //
